# used by luanvim
brew "npm"
brew "ripgrep" # superfast grep replacement used by the search plugins
brew "fd" # superfast fd replacement used by file finding plugins
brew "bat" # a cat(1) clone with syntax highlighting and Git integration
brew "nvim"
brew "python3"
brew "tmux"

cask "iterm2"
cask "slack"

# Window shifter
cask "rectangle"

# setting up for ruby development with Heroku
brew "rbenv"
tap "heroku/brew"
brew "heroku"
brew "postgres"
brew "yarn"

# setting up for php/laraval development
brew "php@8.0"

# Command Line Utilities
brew "z" # fast fuzzy-find directory changer
brew "the_silver_searcher" # ag

# Has tools like sha256sum, others
brew "coreutils"
