# used by luanvim
brew "npm"
brew "ripgrep" # superfast grep replacement used by the search plugins
brew "fd" # superfast fd replacement used by file finding plugins
brew "bat" # a cat(1) clone with syntax highlighting and Git integration
brew "nvim"
brew "gnu-sed" # Used by nvim plugins
brew "python3"
brew "tmux"

cask "iterm2"
cask "slack"

# Window shifter
cask "rectangle"
# Clipboard for copy history
cask "flycut"

# setting up for ruby development with Heroku
brew "rbenv"
tap "heroku/brew"
brew "heroku"
brew "postgresql"
brew "yarn"
brew "ruby-build"
brew 'watch'

# setting up for php/laraval development
brew "php@8.0"

# Command Line Utilities
brew "z" # fast fuzzy-find directory changer
brew "the_silver_searcher" # ag
brew "tree" # show file tree
brew "watch" # watch a command, polling every n seconds

# Has tools like sha256sum, others
brew "coreutils"
#useful json processor
brew "jq"
brew "htop"
# Edit Command line in vi or emacs style
brew "readline"
# tldr pages are like simplified man pages, with examples. Super helpful!
brew "tldr"
brew "certbot" # Generate certs with lets encrypt
brew "nmap"
brew "asdf"


# Git Project management
brew 'just'
# Command Line Prompt
brew "romkatv/powerlevel10k/powerlevel10k"

# Using Docker
brew "docker-compose"

#Architecture decision records
brew "adr-tools"

# Personal website tools
brew "hugo"
#brew "gcloud"

#Azure dev
brew "az"
brew "helm"

# Digital Ocean for bookwyrm
brew "doctl"

# Twilio for Trestle
tap "twilio/brew"
brew "twilio"

# Elixer
brew "autoconf"
brew "openssl@1.1"
brew "wxwidgets"
brew "libxslt"
brew "fop"


# k8s
brew "kubernetes-cli"
brew "minikube"
brew "kustomize"

brew "gpg"
brew "git-crypt"
brew "s3cmd"
brew "libpq" # Postgres tools library
brew "libidn" # Needed to build extensions for mastodon
