# used by luanvim
brew "npm"
brew "ripgrep" # superfast grep replacement used by the search plugins
brew "fd" # superfast fd replacement used by file finding plugins
brew "bat" # a cat(1) clone with syntax highlighting and Git integration
brew "nvim"
brew "gnu-sed" # Used by nvim plugins
brew "python3"
brew "tmux"

cask "iterm2"
cask "slack"

# Window shifter
cask "rectangle"
# Clipboard for copy history
cask "flycut"

# setting up for ruby development with Heroku
brew "rbenv"
tap "heroku/brew"
brew "heroku"
brew "postgresql"
brew "yarn"
brew "ruby-build"

# setting up for php/laraval development
brew "php@8.0"

# Command Line Utilities
brew "z" # fast fuzzy-find directory changer
brew "the_silver_searcher" # ag
brew "tree" # show file tree
# Has tools like sha256sum, others
brew "coreutils"
#useful json processor
brew "jq"
brew "htop"
# Edit Command line in vi or emacs style
brew "readline"
# tldr pages are like simplified man pages, with examples. Super helpful!
brew "tldr"

# Command Line Prompt
brew "romkatv/powerlevel10k/powerlevel10k"

# Using Docker
brew "docker-compose"

#Architecture decision records
brew "adr-tools"

# Personal website tools
brew "hugo"
#brew "gcloud"

#Azure dev
brew "az"
